app/Http/Controllers/HomeController.php

select `municipios`.`id`, `municipios`.`nombre` as `municipio`, `provincias`.`nombre` as `provincia` from `municipios` inner join `provincias` on `municipios`.`prov_id` = `provincias`.`id`
---
    public function index()
    {
        $sql_m = DB::table('municipios')
                ->select('municipios.id','municipios.nombre as municipio', 'provincias.nombre as provincia')
                ->join('provincias', 'municipios.prov_id', '=', 'provincias.id')
                ->get();