app/Http/Controllers/MunicipioController.php

select `municipios`.`id`, `municipios`.`nombre` as `municipio`, `provincias`.`nombre` as `provincia` from `municipios` inner join `provincias` on `municipios`.`prov_id` = `provincias`.`id`
---
    public function listar()
    {
        $datos = DB::table('municipios')
                    ->join('provincias', 'municipios.prov_id', '=', 'provincias.id')
                    ->select('municipios.id','municipios.nombre as municipio','provincias.nombre as provincia')
                    ->get();

select * from `municipios` where `municipios`.`id` = '62' limit 1
---
    public function cargarDatos(REQUEST $request)
    {
        $d = Municipio::findOrFail($request->input('id'));