app/Http/Controllers/ProvinciaController.php

select * from `provincias`
---
    public function listar()
    {
        $datos = Provincia::All();

select * from `provincias` where `provincias`.`id` = '2' limit 1
---
    public function cargarDatos(REQUEST $request)
    {
        $d = Provincia::findOrFail($request->input('id'));