app/Http/Controllers/ReporteController.php

select `municipios`.`id`, `municipios`.`nombre` as `municipio`, `provincias`.`nombre` as `provincia` from `municipios` inner join `provincias` on `municipios`.`prov_id` = `provincias`.`id`
---
    public function index()
    {
        $sql_m = DB::table('municipios')
                ->select('municipios.id','municipios.nombre as municipio', 'provincias.nombre as provincia')
                ->join('provincias', 'municipios.prov_id', '=', 'provincias.id')
                ->get();

select `reportes`.`id`, `reportes`.`nombre`, `reportes`.`direccion`, `municipios`.`nombre` as `municipio` from `reportes` inner join `municipios` on `reportes`.`municipio` = `municipios`.`id`
---
    public function listar()
    {
        $datos = DB::table('reportes')
                    ->select('reportes.id','reportes.nombre','reportes.direccion', 'municipios.nombre as municipio')
                    ->join('municipios', 'reportes.municipio', '=', 'municipios.id')
                    ->get();

insert into `reportes` (`nombre`, `direccion`, `tipo`, `telefono`, `municipio`, `detalle`, `estado`, `updated_at`, `created_at`) values ('Ivanis Mirabal Rodríguez', 'col demo', 'a', '52906767', '25', 'sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg sf sdg sdg', 0, '2023-06-15 13:32:39', '2023-06-15 13:32:39')
---
    public function agregar(REQUEST $request)
    {
        $d = new Reporte;
        $d->nombre = e($request->input('nombre'));
        $d->direccion = e($request->input('direccion'));
        $d->tipo = e($request->input('tipo'));
        $d->telefono = e($request->input('telefono'));
        $d->municipio = e($request->input('municipio'));
        $d->detalle = e($request->input('detalle'));
        $d->estado = 0;

        if ($d->save()):

select * from `reportes` where `reportes`.`id` = '6' limit 1
---
    public function cargarDatos(REQUEST $request)
    {
        $d = Reporte::findOrFail($request->input('id'));

select * from `reportes` where `reportes`.`id` = '5' limit 1
delete from `reportes` where `id` = 5
---
    public function eliminar(REQUEST $request)
    {
        $d = Reporte::find($request->input('id'));
        if ($d->delete()):