app/Http/Controllers/UsuarioController.php

select * from `users`
---
    public function listar()
    {
        $datos = User::All();

insert into `users` (`name`, `email`, `cargo`, `password`, `estado`, `updated_at`, `created_at`) values ('prueba', 'prueba@prueba.cu', 'prueba', '$2y$10$JL715oAGCvtbH3CnbRheTel3d3puDmWUphlRwUwpETtdROydNWXVK', '1', '2023-06-15 13:54:53', '2023-06-15 13:54:53')
---
    public function agregar(REQUEST $request)
    {
        $d = new User;
        $d->name = e($request->input('name'));
        $d->email = e($request->input('email'));
        $d->cargo = e($request->input('cargo'));
        $d->password = Hash::make($request->input('password'));
        $d->estado = e($request->input('estado'));

        if ($d->save()):

select * from `users` where `users`.`id` = '2' limit 1
---
    public function cargarDatos(REQUEST $request)
    {
        $d = User::findOrFail($request->input('id'));

select * from `users` where `users`.`id` = '1' limit 1
update `users` set `estado` = 0, `users`.`updated_at` = '2023-06-15 13:43:16' where `id` = 1
---
    public function deshabilitar(REQUEST $request)
    {
        $d = User::find($request->input('id'));
        $d->estado = 0;

        if ($d->save()):

select * from `users` where `users`.`id` = '2' limit 1
update `users` set `estado` = 1, `users`.`updated_at` = '2023-06-15 13:55:04' where `id` = 2
---
    public function habilitar(REQUEST $request)
    {
        $d = User::find($request->input('id'));
        $d->estado = 1;

        if ($d->save()):

select * from `users` where `users`.`id` = '2' limit 1
---
    public function actualizar(REQUEST $request)
    {
        $d = User::find($request->input('id'));